#ifndef _CAMERA_COORDS_H_
#define _CAMERA_COORDS_H_

#define CAMERACOORDS_VERSION	("ver1.1.0")

class CameraCoords {
	
public:

	//////////////////////////////////////////////////////////////////
	//	CameraCoords												//
	//	功能:														//
	//		构造函数。												//
	//	输入:														//
	//		imgHeight			图像高度;							//
	//		imgWidth			图像宽度;							//
	//		xVanishing			消失点横坐标;						//
	//		yVanishing			消失点纵坐标;						//
	//		nFocus_Dx			摄像头系数;							//
	//		nH					摄像头离地高度;						//
	//	输出: 														//
	//		无。													//
	//////////////////////////////////////////////////////////////////

	CameraCoords(int imgHeight=480, int imgWidth=640, int xVanishing=320, int yVanishing=320, int nFocus_Dx=795, int nH=1300);


	//////////////////////////////////////////////////////////////////
	//	~CameraCoords												//
	//	功能:														//
	//		析构函数。												//
	//	输入:														//
	//		无。													//
	//	输出: 														//
	//		无。													//
	//////////////////////////////////////////////////////////////////

	~CameraCoords();


	//////////////////////////////////////////////////////////////////
	//	int GetDistance												//
	//	功能:														//
	//		计算目标距离。											//
	//	返回值:														//
	//		> 0			成功，返回距离，单位: mm。					//
	//		<=0			参数错误。									//
	//	输入:														//
	//		bottom		目标底端纵坐标;								//
	//	输出: 														//
	//		无。													//
	//////////////////////////////////////////////////////////////////

	int GetDistance(int bottom);


	//////////////////////////////////////////////////////////////////
	//	int GetDistanceAbeam										//
	//	功能:														//
	//		计算目标横向距离。										//
	//	返回值:														//
	//		true		成功										//
	//		false		参数错误									//
	//	输入:														//
	//		x				目标左侧横坐标							//
	//		width			目标像素宽度							//
	//		bottom			目标底端纵坐标							//
	//		isCenterAlig	是否中间对齐							//
	//	输出: 														//
	//		d			横向距离，单位：mm，左侧负右侧正。			//
	//////////////////////////////////////////////////////////////////

	bool GetDistanceAbeam(int x, int width, int bottom, bool isCenterAlig, int& d);


	//////////////////////////////////////////////////////////////////
	//	int GetWidth												//
	//	功能:														//
	//		计算目标宽度。											//
	//	返回值:														//
	//		> 0			成功，返回宽度，单位: mm。					//
	//		<=0			参数错误。									//
	//	输入:														//
	//		bottom		目标底端纵坐标;								//
	//		width		目标像素宽度;								//
	//	输出: 														//
	//		无。													//
	//////////////////////////////////////////////////////////////////

	int GetWidth(int bottom, int width);
	float GetWidth_f(int bottom, int width);


	//////////////////////////////////////////////////////////////////
	//	int GetHeight												//
	//	功能:														//
	//		计算目标高度。											//
	//	返回值:														//
	//		> 0			成功，返回高度，单位: mm。					//
	//		<=0			参数错误。									//
	//	输入:														//
	//		bottom		目标底端纵坐标;								//
	//		height		目标像素高度;								//
	//	输出: 														//
	//		无。													//
	//////////////////////////////////////////////////////////////////

	int GetHeight(int bottom, int height);
	float GetHeight_f(int bottom, int height);


	//////////////////////////////////////////////////////////////////
	//	int GetMiddle												//
	//	功能:														//
	//		计算车道中点。											//
	//	返回值:														//
	//		> 0			成功，返回高度，单位: mm。					//
	//		<=0			参数错误。									//
	//	输入:														//
	//		bottom		目标底端纵坐标;								//
	//	输出: 														//
	//		无。													//
	//////////////////////////////////////////////////////////////////
	
	int GetMiddle(int bottom);


	//////////////////////////////////////////////////////////////////
	//	int FindPosition											//
	//	功能:														//
	//		计算目标距离对应底边。									//
	//	返回值:														//
	//		底边位置。												//
	//	输入:														//
	//		nDistance	目标距离，单位: mm							//
	//	输出: 														//
	//		无。													//
	//////////////////////////////////////////////////////////////////

	int FindPosition(int nDistance);


	int					*m_anDistance;		// 每一像素行的距离，单位：mm
	float				*m_afWidth;			// 每一像素行的单位像素宽度，单位：mm
	int					*m_anMiddle;		// 每一像素行的车道中点
	int					m_nImgHeight;		// 图像高度
	int					m_nImgWidth;		// 图像宽度


private:

	bool InitCoords();

	bool InitMiddle();


	int					m_nFocus;			// 摄像头焦距。这里的焦距实际上是f/dx，因为dx在计算中会约掉，为简化计算取dx=1。
	int					m_nH;				// 摄像头离地面的高度，单位：mm
	float				m_fTheta;			// 摄像头仰角(单位: 弧度)
	int					m_xVanishing;		// 消失点横坐标
	int					m_yVanishing;		// 消失点纵坐标

	int					m_nTopValid;		// 有效距离顶点
	int					m_nFootBottom;		// 摄像头底端纵坐标
};

#endif