7767517
230 263
Input            data                     0 1 data
Convolution      Conv_0                   1 1 data 1082 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
ReLU             LeakyRelu_1              1 1 1082 787 0=1.000000e-01
ConvolutionDepthWise Conv_2                   1 1 787 1085 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_3              1 1 1085 790 0=1.000000e-01
Convolution      Conv_4                   1 1 790 1088 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Convolution      Conv_5                   1 1 1088 1091 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_6              1 1 1091 795 0=1.000000e-01
ConvolutionDepthWise Conv_7                   1 1 795 1094 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             LeakyRelu_8              1 1 1094 798 0=1.000000e-01
Convolution      Conv_9                   1 1 798 1097 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Split            splitncnn_0              1 2 1097 1097_splitncnn_0 1097_splitncnn_1
Convolution      Conv_10                  1 1 1097_splitncnn_1 1100 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_11             1 1 1100 803 0=1.000000e-01
ConvolutionDepthWise Conv_12                  1 1 803 1103 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_13             1 1 1103 806 0=1.000000e-01
Convolution      Conv_14                  1 1 806 1106 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         Add_15                   2 1 1097_splitncnn_0 1106 809 0=0
Convolution      Conv_16                  1 1 809 1109 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_17             1 1 1109 812 0=1.000000e-01
ConvolutionDepthWise Conv_18                  1 1 812 1112 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_19             1 1 1112 815 0=1.000000e-01
Convolution      Conv_20                  1 1 815 1115 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Split            splitncnn_1              1 2 1115 1115_splitncnn_0 1115_splitncnn_1
Convolution      Conv_21                  1 1 1115_splitncnn_1 1118 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_22             1 1 1118 820 0=1.000000e-01
ConvolutionDepthWise Conv_23                  1 1 820 1121 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_24             1 1 1121 823 0=1.000000e-01
Convolution      Conv_25                  1 1 823 1124 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         Add_26                   2 1 1115_splitncnn_0 1124 826 0=0
Split            splitncnn_2              1 2 826 826_splitncnn_0 826_splitncnn_1
Convolution      Conv_27                  1 1 826_splitncnn_1 1127 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_28             1 1 1127 829 0=1.000000e-01
ConvolutionDepthWise Conv_29                  1 1 829 1130 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_30             1 1 1130 832 0=1.000000e-01
Convolution      Conv_31                  1 1 832 1133 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         Add_32                   2 1 826_splitncnn_0 1133 835 0=0
Split            splitncnn_3              1 2 835 835_splitncnn_0 835_splitncnn_1
Convolution      Conv_33                  1 1 835_splitncnn_1 1136 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             LeakyRelu_34             1 1 1136 838 0=1.000000e-01
ConvolutionDepthWise Conv_35                  1 1 838 1139 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             LeakyRelu_36             1 1 1139 841 0=1.000000e-01
Convolution      Conv_37                  1 1 841 1142 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Split            splitncnn_4              1 2 1142 1142_splitncnn_0 1142_splitncnn_1
Convolution      Conv_38                  1 1 1142_splitncnn_1 1145 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             LeakyRelu_39             1 1 1145 846 0=1.000000e-01
ConvolutionDepthWise Conv_40                  1 1 846 1148 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_41             1 1 1148 849 0=1.000000e-01
Convolution      Conv_42                  1 1 849 1151 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
BinaryOp         Add_43                   2 1 1142_splitncnn_0 1151 852 0=0
Split            splitncnn_5              1 2 852 852_splitncnn_0 852_splitncnn_1
Convolution      Conv_44                  1 1 852_splitncnn_1 1154 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             LeakyRelu_45             1 1 1154 855 0=1.000000e-01
ConvolutionDepthWise Conv_46                  1 1 855 1157 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_47             1 1 1157 858 0=1.000000e-01
Convolution      Conv_48                  1 1 858 1160 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
BinaryOp         Add_49                   2 1 852_splitncnn_0 1160 861 0=0
Convolution      Conv_50                  1 1 861 1163 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             LeakyRelu_51             1 1 1163 864 0=1.000000e-01
ConvolutionDepthWise Conv_52                  1 1 864 1166 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_53             1 1 1166 867 0=1.000000e-01
Convolution      Conv_54                  1 1 867 1169 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Split            splitncnn_6              1 2 1169 1169_splitncnn_0 1169_splitncnn_1
Convolution      Conv_55                  1 1 1169_splitncnn_1 1172 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             LeakyRelu_56             1 1 1172 872 0=1.000000e-01
ConvolutionDepthWise Conv_57                  1 1 872 1175 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_58             1 1 1175 875 0=1.000000e-01
Convolution      Conv_59                  1 1 875 1178 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
BinaryOp         Add_60                   2 1 1169_splitncnn_0 1178 878 0=0
Split            splitncnn_7              1 2 878 878_splitncnn_0 878_splitncnn_1
Convolution      Conv_61                  1 1 878_splitncnn_1 1181 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             LeakyRelu_62             1 1 1181 881 0=1.000000e-01
ConvolutionDepthWise Conv_63                  1 1 881 1184 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_64             1 1 1184 884 0=1.000000e-01
Convolution      Conv_65                  1 1 884 1187 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
BinaryOp         Add_66                   2 1 878_splitncnn_0 1187 887 0=0
Split            splitncnn_8              1 2 887 887_splitncnn_0 887_splitncnn_1
Convolution      Conv_67                  1 1 887_splitncnn_1 1190 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             LeakyRelu_68             1 1 1190 890 0=1.000000e-01
ConvolutionDepthWise Conv_69                  1 1 890 1193 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_70             1 1 1193 893 0=1.000000e-01
Convolution      Conv_71                  1 1 893 1196 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7680
Split            splitncnn_9              1 2 1196 1196_splitncnn_0 1196_splitncnn_1
Convolution      Conv_72                  1 1 1196_splitncnn_1 1199 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
ReLU             LeakyRelu_73             1 1 1199 898 0=1.000000e-01
ConvolutionDepthWise Conv_74                  1 1 898 1202 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1440 7=160
ReLU             LeakyRelu_75             1 1 1202 901 0=1.000000e-01
Convolution      Conv_76                  1 1 901 1205 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
BinaryOp         Add_77                   2 1 1196_splitncnn_0 1205 904 0=0
Split            splitncnn_10             1 2 904 904_splitncnn_0 904_splitncnn_1
Convolution      Conv_78                  1 1 904_splitncnn_1 1208 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
ReLU             LeakyRelu_79             1 1 1208 907 0=1.000000e-01
ConvolutionDepthWise Conv_80                  1 1 907 1211 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1440 7=160
ReLU             LeakyRelu_81             1 1 1211 910 0=1.000000e-01
Convolution      Conv_82                  1 1 910 1214 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
BinaryOp         Add_83                   2 1 904_splitncnn_0 1214 913 0=0
Convolution      Conv_84                  1 1 913 1217 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=25600
ReLU             LeakyRelu_85             1 1 1217 916 0=1.000000e-01
ConvolutionDepthWise Conv_86                  1 1 916 1220 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2880 7=320
ReLU             LeakyRelu_87             1 1 1220 919 0=1.000000e-01
Convolution      Conv_88                  1 1 919 1223 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Convolution      Conv_89                  1 1 835_splitncnn_0 1226 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_90             1 1 1226 924 0=1.000000e-01
Convolution      Conv_91                  1 1 887_splitncnn_0 1229 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
ReLU             LeakyRelu_92             1 1 1229 927 0=1.000000e-01
Convolution      Conv_93                  1 1 1223 1232 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=15360
ReLU             LeakyRelu_94             1 1 1232 930 0=1.000000e-01
Convolution      Conv_95                  1 1 930 1235 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
ReLU             LeakyRelu_96             1 1 1235 933 0=1.000000e-01
Split            splitncnn_11             1 2 933 933_splitncnn_0 933_splitncnn_1
Interp           Resize_98                1 1 933_splitncnn_1 938 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_99                2 1 938 927 939 0=0
Split            splitncnn_12             1 2 939 939_splitncnn_0 939_splitncnn_1
Convolution      Conv_100                 1 1 939_splitncnn_1 1238 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_101            1 1 1238 942 0=1.000000e-01
Split            splitncnn_13             1 2 942 942_splitncnn_0 942_splitncnn_1
ConvolutionDepthWise Conv_102                 1 1 942_splitncnn_1 1241 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_103            1 1 1241 945 0=1.000000e-01
Concat           Concat_104               2 1 942_splitncnn_0 945 946 0=0
Convolution      Conv_105                 1 1 946 1244 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Split            splitncnn_14             1 2 1244 1244_splitncnn_0 1244_splitncnn_1
ConvolutionDepthWise Conv_106                 1 1 1244_splitncnn_1 1247 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
Concat           Concat_107               2 1 1244_splitncnn_0 1247 951 0=0
ConvolutionDepthWise Conv_108                 1 1 939_splitncnn_0 1250 0=32 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=800 7=32
Convolution      Conv_109                 1 1 1250 1253 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_110                  2 1 951 1253 956 0=0
Split            splitncnn_15             1 2 956 956_splitncnn_0 956_splitncnn_1
Interp           Resize_112               1 1 956_splitncnn_1 961 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_113               2 1 961 924 962 0=0
Split            splitncnn_16             1 2 962 962_splitncnn_0 962_splitncnn_1
Convolution      Conv_114                 1 1 962_splitncnn_1 1256 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_115            1 1 1256 965 0=1.000000e-01
Split            splitncnn_17             1 2 965 965_splitncnn_0 965_splitncnn_1
ConvolutionDepthWise Conv_116                 1 1 965_splitncnn_1 1259 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_117            1 1 1259 968 0=1.000000e-01
Concat           Concat_118               2 1 965_splitncnn_0 968 969 0=0
Convolution      Conv_119                 1 1 969 1262 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Split            splitncnn_18             1 2 1262 1262_splitncnn_0 1262_splitncnn_1
ConvolutionDepthWise Conv_120                 1 1 1262_splitncnn_1 1265 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
Concat           Concat_121               2 1 1262_splitncnn_0 1265 974 0=0
ConvolutionDepthWise Conv_122                 1 1 962_splitncnn_0 1268 0=32 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=800 7=32
Convolution      Conv_123                 1 1 1268 1271 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_124                  2 1 974 1271 979 0=0
Split            splitncnn_19             1 2 979 979_splitncnn_0 979_splitncnn_1
Convolution      Conv_125                 1 1 979_splitncnn_1 1274 0=16 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=6400
ReLU             LeakyRelu_126            1 1 1274 982 0=1.000000e-01
Concat           Concat_127               2 1 982 956_splitncnn_0 983 0=0
Split            splitncnn_20             1 2 983 983_splitncnn_0 983_splitncnn_1
Convolution      Conv_128                 1 1 983_splitncnn_1 1277 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_129            1 1 1277 986 0=1.000000e-01
Split            splitncnn_21             1 2 986 986_splitncnn_0 986_splitncnn_1
ConvolutionDepthWise Conv_130                 1 1 986_splitncnn_1 1280 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_131            1 1 1280 989 0=1.000000e-01
Concat           Concat_132               2 1 986_splitncnn_0 989 990 0=0
Convolution      Conv_133                 1 1 990 1283 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Split            splitncnn_22             1 2 1283 1283_splitncnn_0 1283_splitncnn_1
ConvolutionDepthWise Conv_134                 1 1 1283_splitncnn_1 1286 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
Concat           Concat_135               2 1 1283_splitncnn_0 1286 995 0=0
ConvolutionDepthWise Conv_136                 1 1 983_splitncnn_0 1289 0=32 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=800 7=32
Convolution      Conv_137                 1 1 1289 1292 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_138                  2 1 995 1292 1000 0=0
Split            splitncnn_23             1 2 1000 1000_splitncnn_0 1000_splitncnn_1
Convolution      Conv_139                 1 1 1000_splitncnn_1 1295 0=16 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=6400
ReLU             LeakyRelu_140            1 1 1295 1003 0=1.000000e-01
Concat           Concat_141               2 1 1003 933_splitncnn_0 1004 0=0
Split            splitncnn_24             1 2 1004 1004_splitncnn_0 1004_splitncnn_1
Convolution      Conv_142                 1 1 1004_splitncnn_1 1298 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_143            1 1 1298 1007 0=1.000000e-01
Split            splitncnn_25             1 2 1007 1007_splitncnn_0 1007_splitncnn_1
ConvolutionDepthWise Conv_144                 1 1 1007_splitncnn_1 1301 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_145            1 1 1301 1010 0=1.000000e-01
Concat           Concat_146               2 1 1007_splitncnn_0 1010 1011 0=0
Convolution      Conv_147                 1 1 1011 1304 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Split            splitncnn_26             1 2 1304 1304_splitncnn_0 1304_splitncnn_1
ConvolutionDepthWise Conv_148                 1 1 1304_splitncnn_1 1307 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
Concat           Concat_149               2 1 1304_splitncnn_0 1307 1016 0=0
ConvolutionDepthWise Conv_150                 1 1 1004_splitncnn_0 1310 0=32 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=800 7=32
Convolution      Conv_151                 1 1 1310 1313 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_152                  2 1 1016 1313 1021 0=0
Convolution      Conv_153                 1 1 979_splitncnn_0 1316 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_154            1 1 1316 1024 0=1.000000e-01
Split            splitncnn_27             1 2 1024 1024_splitncnn_0 1024_splitncnn_1
Convolution      Conv_155                 1 1 1024_splitncnn_1 1319 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_156            1 1 1319 1027 0=1.000000e-01
Convolution      Conv_157                 1 1 1027 1322 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_158            1 1 1322 1030 0=1.000000e-01
Convolution      Conv_159                 1 1 1030 1031 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32
Convolution      Conv_160                 1 1 1024_splitncnn_0 1325 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_161            1 1 1325 1034 0=1.000000e-01
Convolution      Conv_162                 1 1 1034 1328 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_163            1 1 1328 1037 0=1.000000e-01
Split            splitncnn_28             1 2 1037 1037_splitncnn_0 1037_splitncnn_1
Convolution      Conv_164                 1 1 1037_splitncnn_1 bbox8 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Convolution      Conv_165                 1 1 1037_splitncnn_0 1039 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16
Sigmoid          Sigmoid_166              1 1 1039 obj8
Sigmoid          Sigmoid_167              1 1 1031 cls8
Convolution      Conv_168                 1 1 1000_splitncnn_0 1331 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_169            1 1 1331 1044 0=1.000000e-01
Split            splitncnn_29             1 2 1044 1044_splitncnn_0 1044_splitncnn_1
Convolution      Conv_170                 1 1 1044_splitncnn_1 1334 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_171            1 1 1334 1047 0=1.000000e-01
Convolution      Conv_172                 1 1 1047 1337 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_173            1 1 1337 1050 0=1.000000e-01
Convolution      Conv_174                 1 1 1050 1051 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32
Convolution      Conv_175                 1 1 1044_splitncnn_0 1340 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_176            1 1 1340 1054 0=1.000000e-01
Convolution      Conv_177                 1 1 1054 1343 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_178            1 1 1343 1057 0=1.000000e-01
Split            splitncnn_30             1 2 1057 1057_splitncnn_0 1057_splitncnn_1
Convolution      Conv_179                 1 1 1057_splitncnn_1 bbox16 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Convolution      Conv_180                 1 1 1057_splitncnn_0 1059 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16
Sigmoid          Sigmoid_181              1 1 1059 obj16
Sigmoid          Sigmoid_182              1 1 1051 cls16
Convolution      Conv_183                 1 1 1021 1346 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_184            1 1 1346 1064 0=1.000000e-01
Split            splitncnn_31             1 2 1064 1064_splitncnn_0 1064_splitncnn_1
Convolution      Conv_185                 1 1 1064_splitncnn_1 1349 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_186            1 1 1349 1067 0=1.000000e-01
Convolution      Conv_187                 1 1 1067 1352 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_188            1 1 1352 1070 0=1.000000e-01
Convolution      Conv_189                 1 1 1070 1071 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32
Convolution      Conv_190                 1 1 1064_splitncnn_0 1355 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_191            1 1 1355 1074 0=1.000000e-01
Convolution      Conv_192                 1 1 1074 1358 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_193            1 1 1358 1077 0=1.000000e-01
Split            splitncnn_32             1 2 1077 1077_splitncnn_0 1077_splitncnn_1
Convolution      Conv_194                 1 1 1077_splitncnn_1 bbox32 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Convolution      Conv_195                 1 1 1077_splitncnn_0 1079 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16
Sigmoid          Sigmoid_196              1 1 1079 obj32
Sigmoid          Sigmoid_197              1 1 1071 cls32
